teach/programming-mind.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-16 Wed 08:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Minds Programming Minds</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Minds Programming Minds</h1>

<div id="outline-container-org02164c0" class="outline-2">
<h2 id="org02164c0"><span class="section-number-2">1.</span> Outline</h2>
<div class="outline-text-2" id="text-1">
<p>
We know very little about how the minds work, but we do know that minds are at work in the construction of human artifacts. Artificial languages are one such product, and programming languages a particularly relevent subgenre for the effort to explain thinking via the exposition of formal rules and relations and the examination of the implications of such constructions by simulations. It is in a sense a recursion: a mind creates a programming language used by a mind to write a program to simulate the working of a mind in order to help understand and explain the mind to a mind.
</p>

<p>
What then are the unique features of programming languages that might provide hints to methods and capabilities not heretofore exploited? When programming to get something done we appropriately emphasize practical ease and computational efficiencies, but getting something done is not the only purpose behind a computational simulation. It can also be to explicate, and for such purposes we may not want the shortest code, nor to default to the language with the most libraries or the compiler that yields the fastest executing binaries. We may care less about what it is our code produces and more about our code as product.
</p>

<p>
The purpoes today then is to provide some concise examples of some of the language features alluded to in the beginning that we have not had a chance to take advantage of yet in our weekly rush to get things done.
</p>
</div>
</div>

<div id="outline-container-org0c3465a" class="outline-2">
<h2 id="org0c3465a"><span class="section-number-2">2.</span> Lisp</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc79b55b" class="outline-3">
<h3 id="orgc79b55b"><span class="section-number-3">2.1.</span> Code as Data; Code that Rewrites Itself (can also be called metaprogramming)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Under this same heading is the notion of <b>macro</b> [<a href="#citeproc_bib_item_1">1</a>]. Try to do this in python.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">a</span> 5)
(<span style="color: #a020f0;">defvar</span> <span style="color: #a0522d;">b</span> 7)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">set2</span> (var1 var2 value-for-both)
       `(<span style="color: #a020f0;">progn</span>
          (format t <span style="color: #8b2252;">"Old value for ~a was ~a and new value is ~a~%"</span> ',var1 ,var1 ,value-for-both)
          (format t <span style="color: #8b2252;">"Old value for ~a was ~a and new value is ~a~%"</span> ',var2 ,var2 ,value-for-both)
          (setq ,var1 ,value-for-both)
          (setq ,var2 ,value-for-both))) 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp">(set2 a b 3)
</pre>
</div>

<pre class="example">
Old value for A was 5 and new value is 3
Old value for B was 7 and new value is 3
</pre>
</div>

<div id="outline-container-org8ed2e4f" class="outline-4">
<h4 id="org8ed2e4f"><span class="section-number-4">2.1.1.</span> What does this have to do with the mind?</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
The example is a bit contrived, but in the distant past the morning star was known as Phosphorus and the evening star was known as Hesperus. However, we now know that they are the same thing: the planet Venus. In order to make the statement that
</p>
<blockquote>
<p>
The morning star used be be called Phosphorus and the evening star Hesperus, but we now know them both to be Venus.
</p>
</blockquote>

<p>
You have to be able to do the operation above. You need access to the symbolic name (here the X-star), what it used to refer to (here the Greek names), and set them to a common value having the same referent. I maintain you cannot program that in Python.
</p>

<p>
For more on this issue of naming and reference you might want to read about <a href="https://plato.stanford.edu/archives/fall2014/entries/frege/">Frege</a>.
</p>
</div>
</div>
<div id="outline-container-orgf367f41" class="outline-4">
<h4 id="orgf367f41"><span class="section-number-4">2.1.2.</span> Question&#xa0;&#xa0;&#xa0;<span class="tag"><span class="class_discussion">class_discussion</span></span></h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Assume I am right in my claim. Does that mean that Python is not a good language for writing code for mental models?
</p>
</div>
</div>
</div>

<div id="outline-container-orge36b92e" class="outline-3">
<h3 id="orge36b92e"><span class="section-number-3">2.2.</span> Reprogramming a Running Instance</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example" id="org826e243">
;start slime
(load "hack-running.lisp")
</pre>

<p>
This is what is in that file. We should see the repeated application of our bad addition function. 
</p>

<div class="org-src-container">
<pre class="src src-lisp">(ql:quickload <span style="color: #8b2252;">"swank"</span>)

(swank:create-server <span style="color: #483d8b;">:port</span> 4123)

(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">bad-add</span> (a b)
  (- a b))

(<span style="color: #a020f0;">dotimes</span> (i 500)
  (format t <span style="color: #8b2252;">"~&amp;~a + ~a is ~a"</span> 4 5 (bad-add 4 5))
  (sleep 5))
</pre>
</div>

<p>
Now connect to the running instance with <code>slime-connect :port 4123</code> and rewrite the function as <code>(defun bad-add (a b) (+ a b))</code> and when toggling back over note that the function is now adding correctly. Can you do that with Julia? Python? 
</p>
</div>
</div>
</div>
<div id="outline-container-org3b73bcb" class="outline-2">
<h2 id="org3b73bcb"><span class="section-number-2">3.</span> Haskell</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb36d514" class="outline-3">
<h3 id="orgb36d514"><span class="section-number-3">3.1.</span> Lazy Evaluation By Default</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Can you write this in Python?
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #0000ff;">count</span> <span style="color: #a0522d;">=</span> [1 <span style="color: #a0522d;">..</span>]
<span style="color: #0000ff;">take</span> 10 count
</pre>
</div>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> How high can you count?</caption>

<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
<td class="org-right">7</td>
<td class="org-right">8</td>
<td class="org-right">9</td>
<td class="org-right">10</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgcc0609e" class="outline-2">
<h2 id="orgcc0609e"><span class="section-number-2">4.</span> Lean</h2>
<div class="outline-text-2" id="text-4">
<p>
This is an example of a proof assistant that I have not used before. The <a href="https://en.wikipedia.org/wiki/Lean_(proof_assistant)">wikipedia page</a> gives a simple example of how some programming languages can be used to give formal specifications and to prove things. In the example that \(p \land q \implies q \land p\).
</p>
</div>
</div>

<div id="outline-container-org3d71505" class="outline-2">
<h2 id="org3d71505"><span class="section-number-2">5.</span> Companion and Optional Readings</h2>
</div>

<div id="outline-container-org2502cb5" class="outline-2">
<h2 id="org2502cb5"><span class="section-number-2">6.</span> References</h2>
<div class="outline-text-2" id="text-6">
<style>.csl-left-margin{float: left; padding-right: 0em;}
 .csl-right-inline{margin: 0 0 0 1em;}</style><div class="csl-bib-body">
  <div class="csl-entry"><a id="citeproc_bib_item_1"></a>
    <div class="csl-left-margin">1.</div><div class="csl-right-inline">D. Hoyte, <i>Let Over lambda</i> (Lulu. com, 2008).</div>
  </div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Winter 2022</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2022-03-16 Wed 08:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
